{"status":"ok","feed":{"url":"https://medium.com/feed/@alikrema","title":"Stories by Ali Krema on Medium","link":"https://medium.com/@alikrema?source=rss-ee97b2c8fad5------2","author":"","description":"Stories by Ali Krema on Medium","image":"https://cdn-images-1.medium.com/fit/c/150/150/0*cPmLS6JoDe-xWSyD"},"items":[{"title":"Revolutionizing Collaboration: SkillScout’s User-Centered Design Approach","pubDate":"2023-05-06 02:23:51","link":"https://medium.com/@alikrema/revolutionizing-collaboration-skillscouts-user-centered-design-approach-6de74e8746fc?source=rss-ee97b2c8fad5------2","guid":"https://medium.com/p/6de74e8746fc","author":"Ali Krema","thumbnail":"","description":"\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*zqkzMgvQJcnZz6r153abdA.png\"></figure><p>In today’s fast-paced work environment, efficient collaboration is crucial for the success of any organization. However, finding colleagues with specific skills within an organization can be a difficult task, leading to wasted time and reduced productivity. Existing solutions, like searching LinkedIn, don’t address the problem effectively as they lack organization-specific focus and are public for all to see.</p>\n<p>That’s where <em>SkillScout </em>comes in. <em>SkillScout </em>is a platform designed to connect people with specific skills in organizations, businesses, higher education institutions, and research labs, aiming to streamline the process of collaboration and maximize cross-team collaboration. Individuals can create profiles showcasing their skills, bio, availability, and past projects. The platform features powerful searching and filtering and allows users to make requests to others, making it easy to connect with colleagues possessing the desired skill set.</p>\n<p>In our design process, we started by conducting needfinding and user research to understand the pain points and requirements of our target audience. We then went through iterative prototyping stages, refining the user interface through low and high fidelity prototyping. Finally, we conducted a user evaluation to measure the success of our solution in improving collaboration and productivity within organizations.</p>\n<p>In this article, we will delve deeper into the design process, system features, and user evaluation results, providing a comprehensive understanding of the value and potential of <em>SkillScout </em>as a solution to revolutionize collaboration within organizations.</p>\n<h3>The Process</h3>\n<h4>Identifying the problem</h4>\n<p>Our motivation for the need-finding stage was to understand the challenges people in our target group faced. Kimberly chose researchers as her target group, drawing on her experience working in a lab at Penn.</p>\n<p>To gather insights, Kimberly conducted interviews with three individuals who represented diverse roles and experiences within their respective organizations. We aimed to uncover the common issues they encountered while collaborating and seeking expertise from colleagues.</p>\n<p>Through these interviews, we discovered the following key pain points for researchers:</p>\n<ul>\n<li>Difficulty in finding the right person with specific skill sets within the organization.</li>\n<li>Privacy concerns and the fear of idea theft.</li>\n<li>Challenges in establishing connections, particularly for those with limited networks.</li>\n<li>Issues with data sharing and communication within and between departments.</li>\n</ul>\n<h4>Ideating potential solutions</h4>\n<p>Next, our goal was to translate the insights we gained from the need-finding stage into a functional and user-friendly platform. We aimed to address the issues uncovered during our interviews by iteratively refining our design based on user feedback.</p>\n<p>We began by brainstorming and sketching out three initial ideas for <em>SkillScout</em>, each targeting a specific problem identified during the need-finding process. These ideas were:</p>\n<ol>\n<li>A database of researchers looking to collaborate.</li>\n<li>A data sharing tool for easy collaboration.</li>\n<li>An internal tool for finding people with specific skill sets.</li>\n</ol>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/592/1*S5bUHMGmF0hm5DiqiIkNlA.png\"><figcaption>Sketch of Idea #3</figcaption></figure><p>We developed a low-fidelity prototype to test our ideas and gather user feedback. We worked with two evaluators who brought perspectives from both academic and professional research environments, as well as experience in small business organizations. Drawing on their insights, we analyzed the strengths and weaknesses of our two designs — a search directory-based approach and a social media-based approach — and synthesized the best elements of both into our final prototype.</p>\n<p><strong>Search directory design</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/898/1*JIGe70lBtVpc8xitBzfC3g.png\"><figcaption>Preliminary Lo-Fi components</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/736/1*0s9UzExMsVdlGBLNpiyzUQ.png\"><figcaption>Search Directory Design</figcaption></figure><p>Our first design focused on a professional search directory, featuring a simple, clean interface to help users find colleagues with specific skills within their organization. The evaluators praised the ease of use, clear organization, and simplicity.</p>\n<p>However, the evaluators also noted that the minimalist design lacked visual appeal, which could affect user engagement, which was a valid critique, but we weren’t too worried about nailing the visual design yet since it was a role prototype instead of a look and feel one.</p>\n<p><strong>Social media based design</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*nzoZ222FI4S4BR1uaufrew.png\"><figcaption>Social Media Design Sketch</figcaption></figure><p>The second design we developed took a more social media-oriented approach, a “circle” of friends/requests, and a visually appealing design. Users found this design more aesthetically pleasing and engaging, but at the expense of ease of use and navigation. The complexity of the social media functions made it more difficult for users to learn and navigate.</p>\n<p><strong>Final lo-fi prototype</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*a402c-A43D4o7I1SCkAVgg.png\"></figure><p>Our final prototype retains the general layout of the first design, focusing on a central search bar and advanced filtering options. However, we have restructured the search results to resemble the second design, with profile cards that display skill ratings and achievements. Users can either submit a request directly from a profile card or click on it to view more information and submit a request from the individual’s profile.</p>\n<h4>High fidelity prototypes</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*hGy4PNzTYmdZlxRvDgbT_Q.png\"></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*xwVw_HQJV_M1MtLMeA_doQ.png\"><figcaption>Initial Hi-Fi Prototype: Homepage and Inbox</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*UG9eqkncY-VyFELSVXA7qQ.png\"><figcaption>Initial Hi-Fi Prototype: Profile Page</figcaption></figure><p><strong>Usability Improvements<br></strong>Based on the usability critiques from our evaluators, we made several enhancements to the high-fidelity prototype:</p>\n<ul>\n<li>\n<em>Clarifying Achievements:</em> To address the confusion surrounding displayed achievements, we implemented tooltips and an information section to provide users with more context.</li>\n<li>\n<em>Reply Button: </em>To facilitate direct communication, we added a reply button within the messaging interface and enabled users to reply directly from a received message notification.</li>\n<li>\n<em>Notification Indicator:</em> We introduced a red dot or badge on the app icon and relevant sections to alert users to new notifications or messages more prominently.</li>\n<li>\n<em>Search Bar Instructions:</em> We added placeholder text or tooltips in the search bar to clarify the information being indexed, such as “Search by name, skill, or team,” and considered implementing advanced search features with filters.</li>\n</ul>\n<p><strong>Visual Design Enhancements<br></strong>We also addressed visual design critiques to create a more visually appealing and cohesive interface:</p>\n<ul>\n<li>\n<em>Skill bar:</em> We replaced outlined stars with a skill bar that is longer for a more advanced skill, eliminating the impression of being incomplete or unselected.</li>\n<li>\n<em>Uniform Text Size:</em> We established a clear typographic hierarchy with consistent text sizes for headings, subheadings, and body text, enhancing readability and visual appeal.</li>\n<li>\n<em>Color Palette: </em>We reviewed and adjusted the app’s color palette, using complementary colors or a more harmonious color scheme for a visually pleasing interface.</li>\n</ul>\n<p><strong>Revised High-Fidelity Prototype</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Y2ZyVolrr4I4m-ur9UtpbA.png\"><figcaption>The home page now has a no data state for filters, an updated search bar, a red notification dot, and progress bars instead of stars, all because of our user feedback.</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*RtD-wghvvwT4IytTIx6DeA.png\"><figcaption>The profile page remains largely the same, but the text is more uniform now.</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*_UblhF15y7ZB-rb3dn56IQ.png\"><figcaption>The notification/inbox page now has a reply button and the visual design is cleaned up.</figcaption></figure><p>As a result of these changes, the visual design of our high-fidelity prototype is now crisper and stronger. The home page features a no-data state for filters, an updated search bar, a red notification dot, and progress bars instead of stars. The profile page remains largely the same but now has more uniform text, and the notification/inbox page includes a reply button and a cleaner visual design.</p>\n<p><strong>Evaluation of the High-Fidelity Prototype<br></strong>Both of our evaluators found the high-fidelity prototype to be well laid out and usable. They were able to complete tasks such as adding filters, making requests, navigating to profiles, and accepting requests with ease. However, they provided additional feedback for further refinement, such as clearer achievements, the ability to remove skill filters, and the need for a deny/ignore button on the Requests page. In future iterations, we plan to address these concerns and continue to refine our design based on user feedback.</p>\n<h4>Interactive prototype</h4>\n<p>We conducted a final evaluation of our more robust prototype implemented in React, focusing on the look and feel, role, and implementation aspects. Their task was to find a user with skills in Java and submit a request.</p>\n<a href=\"https://medium.com/media/4536f6ceb7c716dae92eccea2086f955/href\">https://medium.com/media/4536f6ceb7c716dae92eccea2086f955/href</a><p>Both of our evaluators found the task easy and obvious to complete. They navigated to the Filters tab, applied a filter for the Java skill, and successfully sent a request to an employee with Java experience. However, upon further investigation of the interface, they provided recommendations for improvement.</p>\n<ol>\n<li>\n<em>Search Box vs. Filters Box Redundancy: </em>One evaluator felt that having both a search box and filters box was unnecessary, while the other appreciated the two options for searching.</li>\n<li>\n<em>Communication Flow:</em> Both evaluators questioned the distinction between using email, Slack, or our interface for communication. They felt that checking <em>SkillScout </em>for incoming requests might not be feasible for some users, particularly those in higher positions. However, they agreed that receiving email notifications for requests and having a centralized location for managing requests could be useful.</li>\n</ol>\n<p>The feedback from our evaluators led us to adding the following to <em>SkillScout</em>:</p>\n<ul>\n<li>\n<em>Refined Search and Filter Functionality:</em> Ways to differentiate the search bar and filter option, ensuring that they serve unique purposes and cater to different user preferences.</li>\n<li>\n<em>Email Notifications: </em>Implementing email notifications for incoming requests, ensuring that users are alerted to new requests without needing to constantly check <em>SkillScout</em>.</li>\n<li>\n<em>In-app Messaging System: </em>Based on one evaluator’s suggestion, we will add an Inbox page within the interface to facilitate communication between users without having to leave our platform.</li>\n</ul>\n<h3>Final Product</h3>\n<p>After going through the iterative design process and incorporating user feedback, we have created <em>SkillScout</em>, a platform that aims to ignite collaboration within organizations by connecting people with specific skills. <em>SkillScout </em>allows individuals to create profiles showcasing their skills, bio, availability, and past projects. With powerful search and filtering options, users can easily find and connect with colleagues possessing the desired skill set. The platform also features a notification system to keep users updated on new requests or messages. In this section, we discuss the final product’s key features, demonstrated through different use cases and user flows.</p>\n<blockquote><strong>Scenario: Find a colleague with Frontend Development skills to help with a project in your research lab</strong></blockquote>\n<p>This scenario can be broken down into several steps that are easy to navigate in <em>SkillScout</em>.</p>\n<h4><strong>Step0: Login to SkillScout</strong></h4>\n<p>Head to the website and log in with your organization credentials.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Z59SbyGD5FbeLtW0g2iqSQ.png\"><figcaption>SkillScout Homepage</figcaption></figure><p>You will be redirected to a homepage where you can see the profile cards of all of your organization members.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*f8IcRVO2R6egccTctqebUQ.png\"><figcaption>SkillScout Homepage</figcaption></figure><h4><strong>Step1: Find a good fit for the job</strong></h4>\n<p><strong>Option1:</strong> If you don’t have a specific colleague in mind that fits the job, you can use the left-pane filter section on the Home Page to select the skills and interests that you are looking for, and the homepage will then filter the profile cards to match your needs. You can use more than one filter, with multiple options per filter. For our scenario, we will use <em>Java </em>for skills, and <em>CSS </em>&amp; <em>Frontend </em>for interests.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/797/1*5U-tCbQjYHZEmw1O5Ca2Ew.png\"><figcaption>Filters pane</figcaption></figure><p>There is also the option to search for the skill or interest directly through the search bar in the header.</p>\n<p><strong>Option2: </strong>if you have a specific person in mind, you can use the same search bar to search directly by name, and the matching profile card(s) will appear.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Ta8GWuq93CRnUH1VFSythg.png\"><figcaption>Searching by name</figcaption></figure><h4><strong>Step2: Learn more about the person(s) of interest (skip to step 3 if you have made your mind already!)</strong></h4>\n<p>Click the name or profile picture on their profile cards, and you will be redirected to their full profile page. From there, you can find more details about the person of interest, such as their past project, contact information, and organization-specific achievements.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*pFjdbIts8Hm6JCCFdQh8tA.png\"></figure><h4><strong>Step3: Contact them!</strong></h4>\n<p>Once you find the right person for your job or project, connecting with them could not be any easier! Just hit <em>New Request</em>, fill in a quick description of the task that you need assistance with, and drop the necessary skills for it; and that’s it! You get a confirmation toast as your request is sent, and the person on the other end receives a <em>New Request Notification</em>.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*hemWtXo3NbNRYtPBdC2NOA.png\"><figcaption>Sending a request</figcaption></figure><p>And that’s it. With just 3–4 steps, you were able to find a person within your organization with a specific skill set that matches your needs — as simple as it gets. But how does the second part of this process work? In other words, how could the other person view your request and get back to you? Let’s take a look at another scenario where we play</p>\n<blockquote><strong>Scenario: You receive several requests from colleagues to assist with side projects</strong></blockquote>\n<h4><strong>Step 0: Log in to <em>SkillScout</em></strong></h4>\n<p>Head to the website and log in with your organization credentials similar to the first scenario</p>\n<h4><strong>Step 1: View your inbox</strong></h4>\n<p>From the header, click on the paper airplane icon to view your inbox, you will see a red notification circle if there are new requests that you have not viewed yet.</p>\n<p>In your inbox, you can view all of your pending requests. The request cards contain an overview of the request and the skills needed for the task (the ones you filled in the first scenario!). From there you can either hit <em>Reply</em> to send a follow-up before confirming, or rather hit <em>Confirm</em> and get started right away with your new side quest; and that’s about it!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*EVusSoJai9pVl3kZLbG4oA.png\"></figure><p>With the ability to search and filter colleagues based on their skills and interests, finding the right person for a job or project has never been easier. The platform’s user-friendly interface and notification system make it easy to connect with colleagues and keep track of pending requests. With the iterative design process and user feedback, <em>SkillScout </em>has been designed to provide a seamless experience for users. Overall, <em>SkillScout </em>is a valuable tool for organizations looking to promote collaboration and utilize their internal resources effectively.</p>\n<h3>Final User Evaluations</h3>\n<h4>Methods</h4>\n<p>For our final set of user evaluations, we wanted to gather a sense of if our interface was both easy and intuitive to use and solved the problems that our users had originally described during our need-finding research. We also wanted to define some areas of future growth for similar interfaces.</p>\n<p>In order to accomplish these goals, we reached out to several users which participated in earlier iterations of user research, and asked to interview them. We presented users with our final product, showed them a quick demo of our product, and allowed them to explore the interface themselves. While the interviews took a conversational tone, we pointedly asked them how intuitive they felt navigating the interface was, if they saw themselves using the system in their daily professional lives, and what types of features or functionality they would like to see in future iterations of <em>SkillScout</em>.</p>\n<h4>Results and Discussion</h4>\n<p>Overall, our users loved the final product we developed. Users commented on how intuitive it felt, stating that all of the interactions simply “made sense.” Some navigation features that users especially seemed to appreciate are the ability to both search and filter based on what felt most intuitive, and the ability to apply multiple search or filter criteria. Users also found the iconography to be very clear and helpful in understanding how to navigate through the interface.</p>\n<p>Our users also saw themselves using this regularly in their daily professional lives. Citing specific examples of past experiences where <em>SkillScout </em>would have greatly helped them in their jobs, users appreciated the ability to use company-specific lingo and share sensitive details of their project which they would not be able to include on public profiles. Users also shared how helpful <em>SkillScout </em>would be when entering the workplace or adjusting to a new company. <em>SkillScout </em>would allow employees to easily find and get to know the skillsets of new employees, encouraging new employees to explore and become involved in new projects easily.</p>\n<p>For future iterations of <em>SkillScout</em>, users pointed towards features including in-house messaging, as opposed to routing messages through email, and a more distinguished my-profile screen in comparison to other users’ profile screens</p>\n<p>In general, our users loved <em>SkillScout’s </em>design, and saw its functionality fitting into their professional lives seamlessly. While there are certainly areas of refinement and future growth, <em>SkillScout </em>certainly accomplishes its goals of helping users discover skills and ignite collaboration within their organizations.</p>\n<p>Lastly, here is a big-picture overview of <em>SkillScout </em>in shape of the poster used for the project’s showcase</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*fLDdFVo_pTQYcHmtw80AvQ.png\"></figure><p><em>SkillScout — ignite collaboration within your organization.</em></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=6de74e8746fc\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*zqkzMgvQJcnZz6r153abdA.png\"></figure><p>In today’s fast-paced work environment, efficient collaboration is crucial for the success of any organization. However, finding colleagues with specific skills within an organization can be a difficult task, leading to wasted time and reduced productivity. Existing solutions, like searching LinkedIn, don’t address the problem effectively as they lack organization-specific focus and are public for all to see.</p>\n<p>That’s where <em>SkillScout </em>comes in. <em>SkillScout </em>is a platform designed to connect people with specific skills in organizations, businesses, higher education institutions, and research labs, aiming to streamline the process of collaboration and maximize cross-team collaboration. Individuals can create profiles showcasing their skills, bio, availability, and past projects. The platform features powerful searching and filtering and allows users to make requests to others, making it easy to connect with colleagues possessing the desired skill set.</p>\n<p>In our design process, we started by conducting needfinding and user research to understand the pain points and requirements of our target audience. We then went through iterative prototyping stages, refining the user interface through low and high fidelity prototyping. Finally, we conducted a user evaluation to measure the success of our solution in improving collaboration and productivity within organizations.</p>\n<p>In this article, we will delve deeper into the design process, system features, and user evaluation results, providing a comprehensive understanding of the value and potential of <em>SkillScout </em>as a solution to revolutionize collaboration within organizations.</p>\n<h3>The Process</h3>\n<h4>Identifying the problem</h4>\n<p>Our motivation for the need-finding stage was to understand the challenges people in our target group faced. Kimberly chose researchers as her target group, drawing on her experience working in a lab at Penn.</p>\n<p>To gather insights, Kimberly conducted interviews with three individuals who represented diverse roles and experiences within their respective organizations. We aimed to uncover the common issues they encountered while collaborating and seeking expertise from colleagues.</p>\n<p>Through these interviews, we discovered the following key pain points for researchers:</p>\n<ul>\n<li>Difficulty in finding the right person with specific skill sets within the organization.</li>\n<li>Privacy concerns and the fear of idea theft.</li>\n<li>Challenges in establishing connections, particularly for those with limited networks.</li>\n<li>Issues with data sharing and communication within and between departments.</li>\n</ul>\n<h4>Ideating potential solutions</h4>\n<p>Next, our goal was to translate the insights we gained from the need-finding stage into a functional and user-friendly platform. We aimed to address the issues uncovered during our interviews by iteratively refining our design based on user feedback.</p>\n<p>We began by brainstorming and sketching out three initial ideas for <em>SkillScout</em>, each targeting a specific problem identified during the need-finding process. These ideas were:</p>\n<ol>\n<li>A database of researchers looking to collaborate.</li>\n<li>A data sharing tool for easy collaboration.</li>\n<li>An internal tool for finding people with specific skill sets.</li>\n</ol>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/592/1*S5bUHMGmF0hm5DiqiIkNlA.png\"><figcaption>Sketch of Idea #3</figcaption></figure><p>We developed a low-fidelity prototype to test our ideas and gather user feedback. We worked with two evaluators who brought perspectives from both academic and professional research environments, as well as experience in small business organizations. Drawing on their insights, we analyzed the strengths and weaknesses of our two designs — a search directory-based approach and a social media-based approach — and synthesized the best elements of both into our final prototype.</p>\n<p><strong>Search directory design</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/898/1*JIGe70lBtVpc8xitBzfC3g.png\"><figcaption>Preliminary Lo-Fi components</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/736/1*0s9UzExMsVdlGBLNpiyzUQ.png\"><figcaption>Search Directory Design</figcaption></figure><p>Our first design focused on a professional search directory, featuring a simple, clean interface to help users find colleagues with specific skills within their organization. The evaluators praised the ease of use, clear organization, and simplicity.</p>\n<p>However, the evaluators also noted that the minimalist design lacked visual appeal, which could affect user engagement, which was a valid critique, but we weren’t too worried about nailing the visual design yet since it was a role prototype instead of a look and feel one.</p>\n<p><strong>Social media based design</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*nzoZ222FI4S4BR1uaufrew.png\"><figcaption>Social Media Design Sketch</figcaption></figure><p>The second design we developed took a more social media-oriented approach, a “circle” of friends/requests, and a visually appealing design. Users found this design more aesthetically pleasing and engaging, but at the expense of ease of use and navigation. The complexity of the social media functions made it more difficult for users to learn and navigate.</p>\n<p><strong>Final lo-fi prototype</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*a402c-A43D4o7I1SCkAVgg.png\"></figure><p>Our final prototype retains the general layout of the first design, focusing on a central search bar and advanced filtering options. However, we have restructured the search results to resemble the second design, with profile cards that display skill ratings and achievements. Users can either submit a request directly from a profile card or click on it to view more information and submit a request from the individual’s profile.</p>\n<h4>High fidelity prototypes</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*hGy4PNzTYmdZlxRvDgbT_Q.png\"></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*xwVw_HQJV_M1MtLMeA_doQ.png\"><figcaption>Initial Hi-Fi Prototype: Homepage and Inbox</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*UG9eqkncY-VyFELSVXA7qQ.png\"><figcaption>Initial Hi-Fi Prototype: Profile Page</figcaption></figure><p><strong>Usability Improvements<br></strong>Based on the usability critiques from our evaluators, we made several enhancements to the high-fidelity prototype:</p>\n<ul>\n<li>\n<em>Clarifying Achievements:</em> To address the confusion surrounding displayed achievements, we implemented tooltips and an information section to provide users with more context.</li>\n<li>\n<em>Reply Button: </em>To facilitate direct communication, we added a reply button within the messaging interface and enabled users to reply directly from a received message notification.</li>\n<li>\n<em>Notification Indicator:</em> We introduced a red dot or badge on the app icon and relevant sections to alert users to new notifications or messages more prominently.</li>\n<li>\n<em>Search Bar Instructions:</em> We added placeholder text or tooltips in the search bar to clarify the information being indexed, such as “Search by name, skill, or team,” and considered implementing advanced search features with filters.</li>\n</ul>\n<p><strong>Visual Design Enhancements<br></strong>We also addressed visual design critiques to create a more visually appealing and cohesive interface:</p>\n<ul>\n<li>\n<em>Skill bar:</em> We replaced outlined stars with a skill bar that is longer for a more advanced skill, eliminating the impression of being incomplete or unselected.</li>\n<li>\n<em>Uniform Text Size:</em> We established a clear typographic hierarchy with consistent text sizes for headings, subheadings, and body text, enhancing readability and visual appeal.</li>\n<li>\n<em>Color Palette: </em>We reviewed and adjusted the app’s color palette, using complementary colors or a more harmonious color scheme for a visually pleasing interface.</li>\n</ul>\n<p><strong>Revised High-Fidelity Prototype</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Y2ZyVolrr4I4m-ur9UtpbA.png\"><figcaption>The home page now has a no data state for filters, an updated search bar, a red notification dot, and progress bars instead of stars, all because of our user feedback.</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*RtD-wghvvwT4IytTIx6DeA.png\"><figcaption>The profile page remains largely the same, but the text is more uniform now.</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*_UblhF15y7ZB-rb3dn56IQ.png\"><figcaption>The notification/inbox page now has a reply button and the visual design is cleaned up.</figcaption></figure><p>As a result of these changes, the visual design of our high-fidelity prototype is now crisper and stronger. The home page features a no-data state for filters, an updated search bar, a red notification dot, and progress bars instead of stars. The profile page remains largely the same but now has more uniform text, and the notification/inbox page includes a reply button and a cleaner visual design.</p>\n<p><strong>Evaluation of the High-Fidelity Prototype<br></strong>Both of our evaluators found the high-fidelity prototype to be well laid out and usable. They were able to complete tasks such as adding filters, making requests, navigating to profiles, and accepting requests with ease. However, they provided additional feedback for further refinement, such as clearer achievements, the ability to remove skill filters, and the need for a deny/ignore button on the Requests page. In future iterations, we plan to address these concerns and continue to refine our design based on user feedback.</p>\n<h4>Interactive prototype</h4>\n<p>We conducted a final evaluation of our more robust prototype implemented in React, focusing on the look and feel, role, and implementation aspects. Their task was to find a user with skills in Java and submit a request.</p>\n<a href=\"https://medium.com/media/4536f6ceb7c716dae92eccea2086f955/href\">https://medium.com/media/4536f6ceb7c716dae92eccea2086f955/href</a><p>Both of our evaluators found the task easy and obvious to complete. They navigated to the Filters tab, applied a filter for the Java skill, and successfully sent a request to an employee with Java experience. However, upon further investigation of the interface, they provided recommendations for improvement.</p>\n<ol>\n<li>\n<em>Search Box vs. Filters Box Redundancy: </em>One evaluator felt that having both a search box and filters box was unnecessary, while the other appreciated the two options for searching.</li>\n<li>\n<em>Communication Flow:</em> Both evaluators questioned the distinction between using email, Slack, or our interface for communication. They felt that checking <em>SkillScout </em>for incoming requests might not be feasible for some users, particularly those in higher positions. However, they agreed that receiving email notifications for requests and having a centralized location for managing requests could be useful.</li>\n</ol>\n<p>The feedback from our evaluators led us to adding the following to <em>SkillScout</em>:</p>\n<ul>\n<li>\n<em>Refined Search and Filter Functionality:</em> Ways to differentiate the search bar and filter option, ensuring that they serve unique purposes and cater to different user preferences.</li>\n<li>\n<em>Email Notifications: </em>Implementing email notifications for incoming requests, ensuring that users are alerted to new requests without needing to constantly check <em>SkillScout</em>.</li>\n<li>\n<em>In-app Messaging System: </em>Based on one evaluator’s suggestion, we will add an Inbox page within the interface to facilitate communication between users without having to leave our platform.</li>\n</ul>\n<h3>Final Product</h3>\n<p>After going through the iterative design process and incorporating user feedback, we have created <em>SkillScout</em>, a platform that aims to ignite collaboration within organizations by connecting people with specific skills. <em>SkillScout </em>allows individuals to create profiles showcasing their skills, bio, availability, and past projects. With powerful search and filtering options, users can easily find and connect with colleagues possessing the desired skill set. The platform also features a notification system to keep users updated on new requests or messages. In this section, we discuss the final product’s key features, demonstrated through different use cases and user flows.</p>\n<blockquote><strong>Scenario: Find a colleague with Frontend Development skills to help with a project in your research lab</strong></blockquote>\n<p>This scenario can be broken down into several steps that are easy to navigate in <em>SkillScout</em>.</p>\n<h4><strong>Step0: Login to SkillScout</strong></h4>\n<p>Head to the website and log in with your organization credentials.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Z59SbyGD5FbeLtW0g2iqSQ.png\"><figcaption>SkillScout Homepage</figcaption></figure><p>You will be redirected to a homepage where you can see the profile cards of all of your organization members.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*f8IcRVO2R6egccTctqebUQ.png\"><figcaption>SkillScout Homepage</figcaption></figure><h4><strong>Step1: Find a good fit for the job</strong></h4>\n<p><strong>Option1:</strong> If you don’t have a specific colleague in mind that fits the job, you can use the left-pane filter section on the Home Page to select the skills and interests that you are looking for, and the homepage will then filter the profile cards to match your needs. You can use more than one filter, with multiple options per filter. For our scenario, we will use <em>Java </em>for skills, and <em>CSS </em>&amp; <em>Frontend </em>for interests.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/797/1*5U-tCbQjYHZEmw1O5Ca2Ew.png\"><figcaption>Filters pane</figcaption></figure><p>There is also the option to search for the skill or interest directly through the search bar in the header.</p>\n<p><strong>Option2: </strong>if you have a specific person in mind, you can use the same search bar to search directly by name, and the matching profile card(s) will appear.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*Ta8GWuq93CRnUH1VFSythg.png\"><figcaption>Searching by name</figcaption></figure><h4><strong>Step2: Learn more about the person(s) of interest (skip to step 3 if you have made your mind already!)</strong></h4>\n<p>Click the name or profile picture on their profile cards, and you will be redirected to their full profile page. From there, you can find more details about the person of interest, such as their past project, contact information, and organization-specific achievements.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*pFjdbIts8Hm6JCCFdQh8tA.png\"></figure><h4><strong>Step3: Contact them!</strong></h4>\n<p>Once you find the right person for your job or project, connecting with them could not be any easier! Just hit <em>New Request</em>, fill in a quick description of the task that you need assistance with, and drop the necessary skills for it; and that’s it! You get a confirmation toast as your request is sent, and the person on the other end receives a <em>New Request Notification</em>.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*hemWtXo3NbNRYtPBdC2NOA.png\"><figcaption>Sending a request</figcaption></figure><p>And that’s it. With just 3–4 steps, you were able to find a person within your organization with a specific skill set that matches your needs — as simple as it gets. But how does the second part of this process work? In other words, how could the other person view your request and get back to you? Let’s take a look at another scenario where we play</p>\n<blockquote><strong>Scenario: You receive several requests from colleagues to assist with side projects</strong></blockquote>\n<h4><strong>Step 0: Log in to <em>SkillScout</em></strong></h4>\n<p>Head to the website and log in with your organization credentials similar to the first scenario</p>\n<h4><strong>Step 1: View your inbox</strong></h4>\n<p>From the header, click on the paper airplane icon to view your inbox, you will see a red notification circle if there are new requests that you have not viewed yet.</p>\n<p>In your inbox, you can view all of your pending requests. The request cards contain an overview of the request and the skills needed for the task (the ones you filled in the first scenario!). From there you can either hit <em>Reply</em> to send a follow-up before confirming, or rather hit <em>Confirm</em> and get started right away with your new side quest; and that’s about it!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*EVusSoJai9pVl3kZLbG4oA.png\"></figure><p>With the ability to search and filter colleagues based on their skills and interests, finding the right person for a job or project has never been easier. The platform’s user-friendly interface and notification system make it easy to connect with colleagues and keep track of pending requests. With the iterative design process and user feedback, <em>SkillScout </em>has been designed to provide a seamless experience for users. Overall, <em>SkillScout </em>is a valuable tool for organizations looking to promote collaboration and utilize their internal resources effectively.</p>\n<h3>Final User Evaluations</h3>\n<h4>Methods</h4>\n<p>For our final set of user evaluations, we wanted to gather a sense of if our interface was both easy and intuitive to use and solved the problems that our users had originally described during our need-finding research. We also wanted to define some areas of future growth for similar interfaces.</p>\n<p>In order to accomplish these goals, we reached out to several users which participated in earlier iterations of user research, and asked to interview them. We presented users with our final product, showed them a quick demo of our product, and allowed them to explore the interface themselves. While the interviews took a conversational tone, we pointedly asked them how intuitive they felt navigating the interface was, if they saw themselves using the system in their daily professional lives, and what types of features or functionality they would like to see in future iterations of <em>SkillScout</em>.</p>\n<h4>Results and Discussion</h4>\n<p>Overall, our users loved the final product we developed. Users commented on how intuitive it felt, stating that all of the interactions simply “made sense.” Some navigation features that users especially seemed to appreciate are the ability to both search and filter based on what felt most intuitive, and the ability to apply multiple search or filter criteria. Users also found the iconography to be very clear and helpful in understanding how to navigate through the interface.</p>\n<p>Our users also saw themselves using this regularly in their daily professional lives. Citing specific examples of past experiences where <em>SkillScout </em>would have greatly helped them in their jobs, users appreciated the ability to use company-specific lingo and share sensitive details of their project which they would not be able to include on public profiles. Users also shared how helpful <em>SkillScout </em>would be when entering the workplace or adjusting to a new company. <em>SkillScout </em>would allow employees to easily find and get to know the skillsets of new employees, encouraging new employees to explore and become involved in new projects easily.</p>\n<p>For future iterations of <em>SkillScout</em>, users pointed towards features including in-house messaging, as opposed to routing messages through email, and a more distinguished my-profile screen in comparison to other users’ profile screens</p>\n<p>In general, our users loved <em>SkillScout’s </em>design, and saw its functionality fitting into their professional lives seamlessly. While there are certainly areas of refinement and future growth, <em>SkillScout </em>certainly accomplishes its goals of helping users discover skills and ignite collaboration within their organizations.</p>\n<p>Lastly, here is a big-picture overview of <em>SkillScout </em>in shape of the poster used for the project’s showcase</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*fLDdFVo_pTQYcHmtw80AvQ.png\"></figure><p><em>SkillScout — ignite collaboration within your organization.</em></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=6de74e8746fc\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["ux-design","human-comuter-interaction","ui-design"]}]}